*** Ability Scores
#+TBLNAME: ABILITY
|   | Ability | Base | Mod | Delta | T. Score | T. Mod |
|---+---------+------+-----+-------+----------+--------|
| # | STR     |    5 | -3  |       |        5 |     -3 |
| # | DEX     |   14 | 2   |       |       14 |      2 |
| # | CON     |   12 | 1   |       |       12 |      1 |
| # | INT     |   14 | 2   |       |       14 |      2 |
| # | WIS     |   12 | 1   |       |       12 |      1 |
| # | CHA     |   21 | 5   |     2 |       23 |      6 |
#+TBLFM: $4=if($3,($3-10)\2, string(""))::$6=if($5,$3+$5, $3)::$7=if($6,($6-10)\2,string(""))
*** AC
|   | Kind     | Base | Arm | Shl | DEX | Enhc | Defl | Nat | Dodge | Size | Total |
|---+----------+------+-----+-----+-----+------+------+-----+-------+------+-------|
| # | Normal   |   10 |     |     |   2 |      |      |     |       |    1 |    13 |
| # | Touch    |   10 |     |     |   2 |      |      |     |       |    1 |    13 |
| # | FlatFoot |   10 |     |     |   0 |      |      |     |       |    1 |    11 |
#+TBLFM: $6=remote(ABILITY,@3$7)::$12=vsum($3..$11)::@4$6=0
*** CMD
|   | Kind        | Base | BAB | STR | DEX | Size | Misc | Total |
|---+-------------+------+-----+-----+-----+------+------+-------|
| # | Regular     |   10 |   2 |  -3 |   2 |   -1 |      |    10 |
| # | Flat Footed |   10 |   2 |  -3 |   0 |   -1 |      |     8 |
#+TBLFM: $4=remote(BAB,@1$2)::$5=remote(ABILITY,@2$7)::$6=remote(ABILITY,@3$7)::$9=vsum($3..$8)::@3$6=0
*** Attack Bonuses
#+TBLNAME: AB
|   | Kind            | BAB | Ability | Size | Misc | Total |
|---+-----------------+-----+---------+------+------+-------|
| # | Melee           |   2 |      -3 |    1 |      |     0 |
| # | Combat Maneuver |   2 |      -3 |  - 1 |      |    -2 |
| # | Ranged          |   2 |       2 |    1 |      |     5 |
#+TBLFM: $3=remote(BAB,@1$2)::$7=vsum($3..$6)::@2$4=remote(ABILITY,@2$7)::@3$4=remote(ABILITY,@2$7)::@4$4=remote(ABILITY,@3$7)
*** Saves
|   | Kind                       | Base | Ability | Total |
|---+----------------------------+------+---------+-------|
| # | Foritude                   |    1 |       1 |     2 |
| # | Reflex                     |    1 |       2 |     3 |
| # | Will (+1 if animal nearby) |    4 |       1 |     5 |
#+TBLFM: $5=vsum($3..$4)::@2$4=remote(ABILITY,@4$7)::@3$4=remote(ABILITY,@3$7)::@4$4=remote(ABILITY,@6$7)
*** Skills
| # | SKill Ranks Per Level | 4 |
#+TBLFM: $3=2+remote(ABILITY,@5$7)
Misc Bonuses: +1 Bluff (Gift of Tongues); +1 Diplomacy (Gift of Tongues); +2 Diplomacy (Familiar); +2 Knowledge [Arcana] (Academecian); +2 Perception (Keen Senses); +4 Stealth (Size)
#+TBLNAME: SKILL
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Acrobatics                | Dex     |     |        |      2 |      |      |     2 |
| # | Appraise                  | Int     | y   |      3 |      2 |    1 |      |     6 |
| # | Bluff                     | Cha     | y   |      3 |      6 |    5 | 1    |    15 |
| # | Climb                     | Str     |     |        |     -3 |      |      |    -3 |
| # | Craft                     | Int     | y   |        |      2 |      |      |     2 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Diplomacy                 | Cha     |     |        |      6 |    5 | 3    |    14 |
| # | Disable Device            | Dex     |     |        |      2 |      |      |     2 |
| # | Disguise                  | Cha     |     |        |      6 |      |      |     6 |
| # | Escape Artist             | Dex     |     |        |      2 |      |      |     2 |
| # | Fly                       | Dex     | y   |        |      2 |      |      |     2 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Handle Animal             | Cha     | y   |      3 |      6 |    1 |      |    10 |
| # | Heal                      | Wis     |     |        |      1 |      |      |     1 |
| # | Intimidate                | Cha     | y   |        |      6 |      |      |     6 |
| # | Knowledge [Arcana]        | Int     | y   |        |      2 |      | 2    |     4 |
| # | Knowledge [Dungeoneering] | Int     |     |        |      2 |      |      |     2 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Knowledge [Engineering]   | Int     |     |        |      2 |      |      |     2 |
| # | Knowledge [Geography]     | Int     |     |        |      2 |      |      |     2 |
| # | Knowledge [History]       | Int     |     |        |      2 |      |      |     2 |
| # | Knowledge [Local]         | Int     |     |        |      2 |      |      |     2 |
| # | Knowledge [Nature]        | Int     | y   |      3 |      2 |    1 |      |     6 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Knowledge [Nobility]      | Int     |     |        |      2 |      |      |     2 |
| # | Knowledge [Planes]        | Int     |     |        |      2 |      |      |     2 |
| # | Knowledge [Religion]      | Int     |     |        |      2 |      |      |     2 |
| # | Linguistics               | Int     |     |        |      2 |    5 |      |     7 |
| # | Perception                | Wis     |     |        |      1 |      | 2    |     3 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Perform                   | Cha     |     |        |      6 |      |      |     6 |
| # | Profession                | Wis     | y   |        |      1 |      |      |     1 |
| # | Ride                      | Dex     |     |        |      2 |      |      |     2 |
| # | Sense Motive              | Wis     |     |        |      1 |      |      |     1 |
| # | Slight of Hand            | Dex     | y   |      3 |      2 |    1 |      |     6 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Spellcraft                | Int     | y   |      3 |      2 |    5 |      |    10 |
| # | Stealth                   | Dex     |     |        |      2 |      | 4    |     6 |
| # | Survival                  | Wis     |     |        |      1 |      |      |     1 |
| # | Swim                      | Str     |     |        |     -3 |      |      |    -3 |
| # | Use Magic Device          | Cha     | y   |      3 |      6 |    1 |      |    10 |
#+TBLFM: $9=vsum($5..$8)::@2$6=remote(ABILITY,@3$7)::@3$6=remote(ABILITY,@5$7)::@4$6=remote(ABILITY,@7$7)::@5$6=remote(ABILITY,@2$7)::@6$6=remote(ABILITY,@5$7)::@8$6=remote(ABILITY,@7$7)::@9$6=remote(ABILITY,@3$7)::@10$6=remote(ABILITY,@7$7)::@11$6=remote(ABILITY,@3$7)::@12$6=remote(ABILITY,@3$7)::@14$6=remote(ABILITY,@7$7)::@15$6=remote(ABILITY,@6$7)::@16$6=remote(ABILITY,@7$7)::@17$6=remote(ABILITY,@5$7)::@18$6=remote(ABILITY,@5$7)::@20$6=remote(ABILITY,@5$7)::@21$6=remote(ABILITY,@5$7)::@22$6=remote(ABILITY,@5$7)::@23$6=remote(ABILITY,@5$7)::@24$6=remote(ABILITY,@5$7)::@26$6=remote(ABILITY,@5$7)::@27$6=remote(ABILITY,@5$7)::@28$6=remote(ABILITY,@5$7)::@29$6=remote(ABILITY,@5$7)::@30$6=remote(ABILITY,@6$7)::@32$6=remote(ABILITY,@7$7)::@33$6=remote(ABILITY,@6$7)::@34$6=remote(ABILITY,@3$7)::@35$6=remote(ABILITY,@6$7)::@36$6=remote(ABILITY,@3$7)::@38$6=remote(ABILITY,@5$7)::@39$6=remote(ABILITY,@3$7)::@40$6=remote(ABILITY,@6$7)::@41$6=remote(ABILITY,@2$7)::@42$6=remote(ABILITY,@7$7)
*** Carrying Capacity
|   | Load       | Limit |
|---+------------+-------|
|   | Light      |    16 |
|   | Medium     |    33 |
|   | Heavy      |    50 |
| # | Over Head  |    50 |
| # | Off Ground |   100 |
| # | Drag       |   250 |
#+TBLFM: @5$3=@4$3::@6$3=@4$3*2::@7$3=@4$3*5
*** Inventory
#+TBLNAME: INVENTORY
Light load = 16
| #                                         |  Total Weight | 14.375 |
|-------------------------------------------+---------------+--------|
| Item                                      |          Slot | Weight |
|-------------------------------------------+---------------+--------|
| Gold (1646)                               |               |        |
| [[Ring of Spell Knowledge][Ring of Spell Knowledge, I]] - Grease       |          Ring |      0 |
| [[Ring of Spell Knowledge][Ring of Spell Knowledge, I]] - Charm Person |          Ring |      0 |
| Headband of Cha +2                        |      Headband |      1 |
| [[Cap of Light][Cap of Light]]                              |          Head |      0 |
| [[Sleeves of Many Garments][Sleeves of Many Garments]]                  |        Wrists |      1 |
| [[Dilettante's Outfit][Dilettante's Outfit]]                       |               |      8 |
| Compass                                   |               |      0 |
| Mirror                                    |               |    1/2 |
| Sack                                      |               |    1/2 |
| Flint and Steel                           |               |      0 |
| Belt Pouch                                |               |    1/4 |
| Spell Component Pouch                     |               |    1/8 |
|-------------------------------------------+---------------+--------|
| Bag of Holding, Minor                     | Weight in Bag |      3 |
|-------------------------------------------+---------------+--------|
| Rope (Silk)                               |             5 |      0 |
| [[Clamor Box][Clamor Box]]                                |             2 |      0 |
| [[Traveler's Any-Tool][Traveler's Any-Tool]]                       |             2 |      0 |
| [[Bloodbrush Extract][Bloodbrush Extract]] (8)                    |             0 |      0 |
| Journal                                   |             1 |      0 |
| Ink                                       |             0 |      0 |
| [[Glue Paper][Glue Paper]] (10)                           |             0 |      0 |
| Paper (10)                                |             0 |      0 |
| Pen                                       |             0 |      0 |
| Blanket                                   |             3 |      0 |
| Bedroll                                   |             5 |      0 |
| Mess Kit                                  |             1 |      0 |
| Soap                                      |           1/2 |      0 |
| Coffee Pot                                |             4 |      0 |
#+TBLFM: @<$3=vsum(@3$3..@>$3)
*** Ability Scores
#+TBLNAME: RABILITY
|   | Ability | Base | Mod | Delta | T. Score | T. Mod |
|---+---------+------+-----+-------+----------+--------|
| # | STR     |    3 | -4  |       | 3        | -4     |
| # | DEX     |   16 | 3   |       | 16       | 3      |
| # | CON     |    8 | -1  |       | 8        | -1     |
| # | INT     |    8 | -1  |       | 8        | -1     |
| # | WIS     |   12 | 1   |       | 12       | 1      |
| # | CHA     |    6 | -2  |       | 6        | -2     |
#+TBLFM: $4=if($3,($3-10)\2, string(""))::$6=if($5,$3+$5, $3)::$7=if($6,($6-10)\2,string(""))
*** AC
|   | Kind     | Base | Arm | Shl | DEX | Enhc | Defl | Nat | Dodge | Size | Total |
|---+----------+------+-----+-----+-----+------+------+-----+-------+------+-------|
| # | Normal   |   10 |     |     |   3 |      |      |   3 |       |    1 |    17 |
| # | Touch    |   10 |     |     |   3 |      |      |   3 |       |    1 |    17 |
| # | FlatFoot |   10 |     |     |   0 |      |      |   3 |       |    1 |    14 |
#+TBLFM: $6=remote(RABILITY,@3$7)::$12=vsum($3..$11)::@4$6=0
*** CMD
|   | Kind        | Base | BAB | STR | DEX | Size | Misc | Total |
|---+-------------+------+-----+-----+-----+------+------+-------|
| # | Regular     |   10 |   2 |  -4 |   3 |   -1 |      |    10 |
| # | Flat Footed |   10 |   2 |  -4 |   0 |   -1 |      |     7 |
#+TBLFM: $4=remote(RBAB,@1$3)::$5=remote(RABILITY,@2$7)::$6=remote(RABILITY,@3$7)::$9=vsum($3..$8)::@3$6=0
*** Attack Bonuses
#+TBLNAME: RAB
|   | Kind            | BAB | Ability | Size | Misc | Total |
|---+-----------------+-----+---------+------+------+-------|
| # | Melee           |   2 |      -4 |    1 |      |    -1 |
| # | Combat Maneuver |   2 |      -4 |  - 1 |      |    -3 |
| # | Ranged          |   2 |       3 |    1 |      |     6 |
#+TBLFM: $3=remote(RBAB,@1$3)::$7=vsum($3..$6)::@2$4=remote(RABILITY,@2$7)::@3$4=remote(RABILITY,@2$7)::@4$4=remote(RABILITY,@3$7)
*** Saves
|   | Kind     | Base | Ability | Total |
|---+----------+------+---------+-------|
| # | Foritude |    2 |      -1 |     1 |
| # | Reflex   |    2 |       3 |     5 |
| # | Will     |    4 |       1 |     5 |
#+TBLFM: $5=vsum($3..$4)::@2$4=remote(RABILITY,@4$7)::@3$4=remote(RABILITY,@3$7)::@4$4=remote(RABILITY,@6$7)
*** Skills
| # | SKill Ranks Per Level | 4 |
Favored Class Ranks : 5
Misc Bonuses: +10 Acrobatics when jumping (Racial), +1 Perception (Racial), +2 Perception (Alertness), +2 Sense Motive (Alertness)
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Acrobatics                | Dex     | y   |        |      3 |    0 |      |     3 |
| # | Appraise                  | Int     |     |        |     -1 |    1 |      |     0 |
| # | Bluff                     | Cha     |     |        |     -2 |    5 |      |     3 |
| # | Climb                     | Str     | y   |        |     -4 |    0 |      |    -4 |
| # | Craft                     | Int     |     |        |     -1 |    0 |      |    -1 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Diplomacy                 | Cha     |     |        |     -2 |    5 |      |     3 |
| # | Disable Device            | Dex     |     |        |      3 |    0 |      |     3 |
| # | Disguise                  | Cha     |     |        |     -2 |    0 |      |    -2 |
| # | Escape Artist             | Dex     |     |        |      3 |    0 |      |     3 |
| # | Fly                       | Dex     | y   |        |      3 |    0 |      |     3 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Handle Animal             | Cha     |     |        |     -2 |    1 |      |    -1 |
| # | Heal                      | Wis     |     |        |      1 |    0 |      |     1 |
| # | Intimidate                | Cha     |     |        |     -2 |    0 |      |    -2 |
| # | Knowledge [Arcana]        | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [Dungeoneering] | Int     |     |        |     -1 |    0 |      |    -1 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Knowledge [Engineering]   | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [Geography]     | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [History]       | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [Local]         | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [Nature]        | Int     |     |        |     -1 |    1 |      |     0 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Knowledge [Nobility]      | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [Planes]        | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Knowledge [Religion]      | Int     |     |        |     -1 |    0 |      |    -1 |
| # | Linguistics               | Int     |     |        |     -1 |    5 |      |     4 |
| # | Perception                | Wis     | y   |        |      1 |    0 | 3    |     4 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Perform                   | Cha     |     |        |     -2 |    0 |      |    -2 |
| # | Profession                | Wis     |     |        |      1 |    0 |      |     1 |
| # | Ride                      | Dex     |     |        |      3 |    0 |      |     3 |
| # | Sense Motive              | Wis     |     |        |      1 |    0 | 2    |     3 |
| # | Slight of Hand            | Dex     |     |        |      3 |    5 |      |     8 |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
|   | Skill Name                | Ability | CS? | CS Mod | Ab Mod | Rank | Misc | Total |
|---+---------------------------+---------+-----+--------+--------+------+------+-------|
| # | Spellcraft                | Int     |     |        |     -1 |    1 |      |     0 |
| # | Stealth                   | Dex     | y   | 3      |      3 |    7 |      |    13 |
| # | Survival                  | Wis     |     |        |      1 |    0 |      |     1 |
| # | Swim                      | Str     | y   |        |     -4 |    0 |      |    -4 |
| # | Use Magic Device          | Cha     |     |        |     -2 |    1 |      |    -1 |
#+TBLFM: $7=remote(SKILL,$7)::$9=vsum($5..$8)::@2$6=remote(RABILITY,@3$7)::@3$6=remote(RABILITY,@5$7)::@4$6=remote(RABILITY,@7$7)::@5$6=remote(RABILITY,@2$7)::@6$6=remote(RABILITY,@5$7)::@8$6=remote(RABILITY,@7$7)::@9$6=remote(RABILITY,@3$7)::@10$6=remote(RABILITY,@7$7)::@11$6=remote(RABILITY,@3$7)::@12$6=remote(RABILITY,@3$7)::@14$6=remote(RABILITY,@7$7)::@15$6=remote(RABILITY,@6$7)::@16$6=remote(RABILITY,@7$7)::@17$6=remote(RABILITY,@5$7)::@18$6=remote(RABILITY,@5$7)::@20$6=remote(RABILITY,@5$7)::@21$6=remote(RABILITY,@5$7)::@22$6=remote(RABILITY,@5$7)::@23$6=remote(RABILITY,@5$7)::@24$6=remote(RABILITY,@5$7)::@26$6=remote(RABILITY,@5$7)::@27$6=remote(RABILITY,@5$7)::@28$6=remote(RABILITY,@5$7)::@29$6=remote(RABILITY,@5$7)::@30$6=remote(RABILITY,@6$7)::@32$6=remote(RABILITY,@7$7)::@33$6=remote(RABILITY,@6$7)::@34$6=remote(RABILITY,@3$7)::@35$6=remote(RABILITY,@6$7)::@36$6=remote(RABILITY,@3$7)::@38$6=remote(RABILITY,@5$7)::@39$6=remote(RABILITY,@3$7)::@40$6=remote(RABILITY,@6$7)::@41$6=remote(RABILITY,@2$7)::@42$6=remote(RABILITY,@7$7)
